{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "toc": true
   },
   "source": [
    "<h1>Table of Contents<span class=\"tocSkip\"></span></h1>\n",
    "<div class=\"toc\"><ul class=\"toc-item\"><li><span><a href=\"#Discover-Thoth's-Graph-Structure\" data-toc-modified-id=\"Discover-Thoth's-Graph-Structure-1\"><span class=\"toc-item-num\">1&nbsp;&nbsp;</span>Discover Thoth's Graph Structure</a></span><ul class=\"toc-item\"><li><span><a href=\"#Connect-to-JanusGraph-Instance\" data-toc-modified-id=\"Connect-to-JanusGraph-Instance-1.1\"><span class=\"toc-item-num\">1.1&nbsp;&nbsp;</span>Connect to JanusGraph Instance</a></span></li><li><span><a href=\"#Vertex-and-Edge-Labels\" data-toc-modified-id=\"Vertex-and-Edge-Labels-1.2\"><span class=\"toc-item-num\">1.2&nbsp;&nbsp;</span>Vertex and Edge Labels</a></span></li><li><span><a href=\"#Vertex-and-Edge-Instances\" data-toc-modified-id=\"Vertex-and-Edge-Instances-1.3\"><span class=\"toc-item-num\">1.3&nbsp;&nbsp;</span>Vertex and Edge Instances</a></span></li></ul></li><li><span><a href=\"#Discover-the-packages-inside-Thoth\" data-toc-modified-id=\"Discover-the-packages-inside-Thoth-2\"><span class=\"toc-item-num\">2&nbsp;&nbsp;</span>Discover the packages inside Thoth</a></span></li><li><span><a href=\"#Select-one-package-and-discover-more-about-it\" data-toc-modified-id=\"Select-one-package-and-discover-more-about-it-3\"><span class=\"toc-item-num\">3&nbsp;&nbsp;</span>Select one package and discover more about it</a></span></li></ul></div>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Discover Thoth's Graph Structure"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This notebook is addressed to users and developers of Thoth that want to discover the content of Thoth's Graph Database."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "First it's important to look at schema model of Thoth Graph Database."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T09:54:19.843806Z",
     "start_time": "2019-04-08T09:54:19.718428Z"
    }
   },
   "source": [
    "![Thoth Graph Database](https://raw.githubusercontent.com/thoth-station/storages/master/docs/schema.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Connect to JanusGraph Instance"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In order to discover what is inside the Graph Database, we need to connect to JanusGraph instance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T15:56:07.192656Z",
     "start_time": "2019-04-08T15:56:06.030148Z"
    }
   },
   "outputs": [],
   "source": [
    "from thoth.storages.graph import GraphDatabase\n",
    "from thoth.lab import GraphQueryResult as gqr\n",
    "\n",
    "graph_db = GraphDatabase.create('janusgraph.test.thoth-station.ninja', port=8182)\n",
    "graph_db.connect()\n",
    "g = graph_db.g   # We will use raw Gremlin traversal in examples."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We need to import objects that will be used in the notebook"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T15:56:08.012869Z",
     "start_time": "2019-04-08T15:56:07.687442Z"
    }
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from pprint import pprint\n",
    "from thoth.solver import pip_compile\n",
    "from thoth.storages.graph.models import ALL_MODELS\n",
    "from gremlin_python.process.graph_traversal import has\n",
    "from gremlin_python.process.traversal import Operator\n",
    "from gremlin_python.process.traversal import Pop\n",
    "from gremlin_python.process.traversal import not_\n",
    "from gremlin_python.process.traversal import P\n",
    "from gremlin_python.process.graph_traversal import identity\n",
    "from gremlin_python.process.graph_traversal import path\n",
    "from gremlin_python.process.graph_traversal import outE\n",
    "from gremlin_python.process.graph_traversal import out\n",
    "from gremlin_python.process.graph_traversal import inE\n",
    "from gremlin_python.process.graph_traversal import inV\n",
    "from gremlin_python.process.graph_traversal import select\n",
    "from gremlin_python.process.graph_traversal import values\n",
    "from gremlin_python.process.graph_traversal import fold\n",
    "from gremlin_python.process.graph_traversal import constant\n",
    "from gremlin_python.process.graph_traversal import project"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Vertex and Edge Labels"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "List all the available vertex labels in the graph database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:03:32.061323Z",
     "start_time": "2019-04-08T07:03:32.039951Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Vertex</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>cve</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>inspection_software_stack</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>software_stack_observation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>adviser_software_stack</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>rpm_requirement</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>buildtime_environment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>python_artifact</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>python_package_index</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>deb_package_version</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>user_software_stack</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>build_observation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>hardware_information</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ecosystem_solver</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>rpm_package_version</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>package</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>runtime_environment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>python_package_version</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        Vertex\n",
       "0                          cve\n",
       "1    inspection_software_stack\n",
       "2   software_stack_observation\n",
       "3       adviser_software_stack\n",
       "4              rpm_requirement\n",
       "5        buildtime_environment\n",
       "6              python_artifact\n",
       "7         python_package_index\n",
       "8          deb_package_version\n",
       "9          user_software_stack\n",
       "10           build_observation\n",
       "11        hardware_information\n",
       "12            ecosystem_solver\n",
       "13         rpm_package_version\n",
       "14                     package\n",
       "15         runtime_environment\n",
       "16      python_package_version"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create list of vertices \n",
    "vertex_labels = []\n",
    "for element in ALL_MODELS:\n",
    "\n",
    "    if element.__type__ == \"vertex\":\n",
    "        vertex_labels.append(element.__label__)\n",
    "        \n",
    "# Create the pandas DataFrame \n",
    "df = pd.DataFrame(vertex_labels, columns = ['Vertex'])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "List all the available edge labels in the graph database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:03:39.815981Z",
     "start_time": "2019-04-08T07:03:39.803593Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Edge</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>runs_in</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>has_artifact</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>observed</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>deb_pre_depends</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>requires</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>builds_on</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>solved</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>depends_on</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>runs_on</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>has_version</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>creates_stack</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>is_part_of</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>deb_replaces</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>builds_in</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>deb_depends</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>has_vulnerability</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 Edge\n",
       "0             runs_in\n",
       "1        has_artifact\n",
       "2            observed\n",
       "3     deb_pre_depends\n",
       "4            requires\n",
       "5           builds_on\n",
       "6              solved\n",
       "7          depends_on\n",
       "8             runs_on\n",
       "9         has_version\n",
       "10      creates_stack\n",
       "11         is_part_of\n",
       "12       deb_replaces\n",
       "13          builds_in\n",
       "14        deb_depends\n",
       "15  has_vulnerability"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create list of edges\n",
    "edge_labels = []\n",
    "for element in ALL_MODELS:\n",
    "\n",
    "    if element.__type__ == \"edge\":\n",
    "        edge_labels.append(element.__label__)\n",
    "        \n",
    "# Create the pandas DataFrame \n",
    "df = pd.DataFrame(edge_labels, columns = ['Edge'])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Vertex and Edge Instances"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's have an idea of the size of Thoth's Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:03:54.382766Z",
     "start_time": "2019-04-08T07:03:43.607917Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of vertex instances in the graph database: 39865\n",
      "Number of edge instances in the graph database: 637271\n"
     ]
    }
   ],
   "source": [
    "print(f\"Number of vertex instances in the graph database: {gqr(g.V().count().next()).result:d}\")\n",
    "print(f\"Number of edge instances in the graph database: {gqr(g.E().count().next()).result:d}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's see which vertex label has more instances"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T18:55:48.354331Z",
     "start_time": "2019-04-08T18:55:42.356460Z"
    },
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Number of vertex instances present in the graph database (sum): 39864\n",
      "Number of vertex instances present in the graph database: 39865\n"
     ]
    }
   ],
   "source": [
    "# Extract the number of instances for each vertex label\n",
    "\n",
    "# List of vertex labels\n",
    "vertex_labels = [element.__label__ for element in ALL_MODELS if element.__type__ == \"vertex\"]\n",
    "\n",
    "# Dict of vertex labels and counts \n",
    "vertices_number = gqr(g.V().has(\"__type__\", \"vertex\").groupCount().by(\"__label__\").next()).result\n",
    "\n",
    "list_vertices_counts = []\n",
    "\n",
    "for vertex in vertex_labels:\n",
    "    \n",
    "    if vertex in vertices_number.keys():\n",
    "        \n",
    "        list_vertices_counts.append([vertex, vertices_number[vertex]])\n",
    "        \n",
    "    else:\n",
    "        list_vertices_counts.append([vertex, 0])\n",
    "        \n",
    "\n",
    "print(f\"\\nNumber of vertex instances present in the graph database (sum): {sum(vertex_c[1] for vertex_c in list_vertices_counts)}\")\n",
    "print(f\"Number of vertex instances present in the graph database: {gqr(graph_db.g.V().count().next()).result:d}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T18:55:51.406022Z",
     "start_time": "2019-04-08T18:55:51.384330Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Vertex</th>\n",
       "      <th>N. Instances</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>python_package_version</td>\n",
       "      <td>22015</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>python_artifact</td>\n",
       "      <td>15407</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>package</td>\n",
       "      <td>946</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>cve</td>\n",
       "      <td>796</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>rpm_requirement</td>\n",
       "      <td>513</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>rpm_package_version</td>\n",
       "      <td>174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>python_package_index</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ecosystem_solver</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>buildtime_environment</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>runtime_environment</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>inspection_software_stack</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>adviser_software_stack</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>software_stack_observation</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>deb_package_version</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>user_software_stack</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>build_observation</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>hardware_information</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        Vertex  N. Instances\n",
       "0       python_package_version         22015\n",
       "8              python_artifact         15407\n",
       "2                      package           946\n",
       "3                          cve           796\n",
       "9              rpm_requirement           513\n",
       "1          rpm_package_version           174\n",
       "10        python_package_index             7\n",
       "16            ecosystem_solver             4\n",
       "6        buildtime_environment             1\n",
       "13         runtime_environment             1\n",
       "4    inspection_software_stack             0\n",
       "5       adviser_software_stack             0\n",
       "7   software_stack_observation             0\n",
       "11         deb_package_version             0\n",
       "12         user_software_stack             0\n",
       "14           build_observation             0\n",
       "15        hardware_information             0"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Show the number of instances for each vertex label\n",
    "df = pd.DataFrame(list_vertices_counts, columns = ['Vertex', 'N. Instances']).sort_values(by='N. Instances',ascending=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's see which edge label has more instances"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:05:56.414463Z",
     "start_time": "2019-04-08T07:05:34.521986Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Number of edge instances present in the graph database (sum): 637271\n",
      "Number of edge instances present in the graph database: 637271\n"
     ]
    }
   ],
   "source": [
    "# List of edge labels\n",
    "edge_labels = [element.__label__ for element in ALL_MODELS if element.__type__ == \"edge\"]\n",
    "\n",
    "# Dict of edge labels and counts \n",
    "edges_number = gqr(g.E().has(\"__type__\", \"edge\").groupCount().by(\"__label__\").next()).result\n",
    "\n",
    "list_edges_counts = []\n",
    "\n",
    "for edge in edge_labels:\n",
    "    \n",
    "    if edge in edges_number.keys():\n",
    "        \n",
    "        list_edges_counts.append([edge, edges_number[edge]])\n",
    "        \n",
    "    else:\n",
    "        list_edges_counts.append([edge, 0])\n",
    "        \n",
    "\n",
    "print(f\"\\nNumber of edge instances present in the graph database (sum): {sum(edge_c[1] for edge_c in list_edges_counts)}\")\n",
    "print(f\"Number of edge instances present in the graph database: {gqr(graph_db.g.E().count().next()).result:d}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:08:40.966892Z",
     "start_time": "2019-04-08T07:08:40.953871Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Edge</th>\n",
       "      <th>N. Instances</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>solved</td>\n",
       "      <td>405001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>depends_on</td>\n",
       "      <td>156006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>has_vulnerability</td>\n",
       "      <td>34810</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>has_version</td>\n",
       "      <td>22283</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>has_artifact</td>\n",
       "      <td>15557</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>requires</td>\n",
       "      <td>3350</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>is_part_of</td>\n",
       "      <td>264</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>runs_in</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>observed</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>deb_pre_depends</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>builds_on</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>runs_on</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>creates_stack</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>deb_replaces</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>builds_in</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>deb_depends</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 Edge  N. Instances\n",
       "6              solved        405001\n",
       "7          depends_on        156006\n",
       "15  has_vulnerability         34810\n",
       "9         has_version         22283\n",
       "1        has_artifact         15557\n",
       "4            requires          3350\n",
       "11         is_part_of           264\n",
       "0             runs_in             0\n",
       "2            observed             0\n",
       "3     deb_pre_depends             0\n",
       "5           builds_on             0\n",
       "8             runs_on             0\n",
       "10      creates_stack             0\n",
       "12       deb_replaces             0\n",
       "13          builds_in             0\n",
       "14        deb_depends             0"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Show the number of instances for each vertex label\n",
    "df = pd.DataFrame(list_edges_counts, columns = ['Edge', 'N. Instances']).sort_values(by='N. Instances',ascending=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Looking at the relations between vertices which are currently instanciated"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T09:47:10.701974Z",
     "start_time": "2019-04-08T09:46:47.373955Z"
    }
   },
   "outputs": [],
   "source": [
    "vertex_edge_vertex = gqr(g.V()\n",
    "                         .outE()\n",
    "                         .otherV()\n",
    "                         .groupCount()\n",
    "                         .by(path()\n",
    "                         .by(\"__label__\"))\n",
    "                         .next()).result\n",
    "\n",
    "vertex_edge_vertex_list = []\n",
    "for triple_string, counts in vertex_edge_vertex.items():\n",
    "    triple = triple_string.lstrip(\"[\").rstrip(\"]\").replace(\" \",\"\").split(\",\")\n",
    "    vertex_edge_vertex_list.append([str(triple[0]), str(triple[1]), str(triple[2]), counts])\n",
    "vertex_edge_vertex_list.sort(key=lambda x: x[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T09:47:10.743304Z",
     "start_time": "2019-04-08T09:47:10.706735Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>VERTEX</th>\n",
       "      <th>EDGE</th>\n",
       "      <th>VERTEX</th>\n",
       "      <th>COUNTS</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ecosystem_solver</td>\n",
       "      <td>solved</td>\n",
       "      <td>python_package_version</td>\n",
       "      <td>405001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>package</td>\n",
       "      <td>has_version</td>\n",
       "      <td>rpm_package_version</td>\n",
       "      <td>267</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>package</td>\n",
       "      <td>has_version</td>\n",
       "      <td>python_package_version</td>\n",
       "      <td>22016</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>python_package_version</td>\n",
       "      <td>depends_on</td>\n",
       "      <td>python_package_version</td>\n",
       "      <td>156006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>python_package_version</td>\n",
       "      <td>has_vulnerability</td>\n",
       "      <td>cve</td>\n",
       "      <td>34810</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>python_package_version</td>\n",
       "      <td>is_part_of</td>\n",
       "      <td>buildtime_environment</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>python_package_version</td>\n",
       "      <td>has_artifact</td>\n",
       "      <td>python_artifact</td>\n",
       "      <td>15557</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>rpm_package_version</td>\n",
       "      <td>requires</td>\n",
       "      <td>rpm_requirement</td>\n",
       "      <td>3350</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>rpm_package_version</td>\n",
       "      <td>is_part_of</td>\n",
       "      <td>buildtime_environment</td>\n",
       "      <td>174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>rpm_package_version</td>\n",
       "      <td>is_part_of</td>\n",
       "      <td>runtime_environment</td>\n",
       "      <td>89</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   VERTEX               EDGE                  VERTEX  COUNTS\n",
       "0        ecosystem_solver             solved  python_package_version  405001\n",
       "1                 package        has_version     rpm_package_version     267\n",
       "2                 package        has_version  python_package_version   22016\n",
       "3  python_package_version         depends_on  python_package_version  156006\n",
       "4  python_package_version  has_vulnerability                     cve   34810\n",
       "5  python_package_version         is_part_of   buildtime_environment       1\n",
       "6  python_package_version       has_artifact         python_artifact   15557\n",
       "7     rpm_package_version           requires         rpm_requirement    3350\n",
       "8     rpm_package_version         is_part_of   buildtime_environment     174\n",
       "9     rpm_package_version         is_part_of     runtime_environment      89"
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.DataFrame(vertex_edge_vertex_list, columns = ['VERTEX','EDGE','VERTEX', 'COUNTS'])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Discover the packages inside Thoth"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Check the allowed sources for the packages inside Thoth database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T19:16:47.811383Z",
     "start_time": "2019-04-08T19:16:42.869332Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>URL</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 URL\n",
       "0                            https://pypi.org/simple\n",
       "1  https://tensorflow.pypi.thoth-station.ninja/in...\n",
       "2  https://tensorflow.pypi.thoth-station.ninja/in...\n",
       "3  https://tensorflow.pypi.thoth-station.ninja/in...\n",
       "4  https://tensorflow.pypi.thoth-station.ninja/in...\n",
       "5  https://tensorflow.pypi.thoth-station.ninja/in...\n",
       "6  https://tensorflow.pypi.thoth-station.ninja/in..."
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "known_thoth_url = graph_db.get_python_package_index_urls()\n",
    "df = pd.DataFrame(known_thoth_url, columns = ['URL'])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Check how many packages for each url index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T19:20:53.095938Z",
     "start_time": "2019-04-08T19:20:48.466957Z"
    }
   },
   "outputs": [],
   "source": [
    "n_packages_per_index = gqr(g.V()\n",
    "                         .has(\"index_url\")\n",
    "                         .groupCount()\n",
    "                         .by(\"index_url\")\n",
    "                         .next()).result\n",
    "\n",
    "n_packages_per_index_list = [[url_index, n_packages] for url_index, n_packages in packages_per_index.items()]\n",
    "all_url = [url_index for url_index in packages_per_index.keys()]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T18:35:18.934768Z",
     "start_time": "2019-04-08T18:35:18.921317Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>URL</th>\n",
       "      <th>N.packages</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>18398</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>605</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>604</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>605</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>600</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 URL  N.packages\n",
       "0  https://tensorflow.pypi.thoth-station.ninja/in...         601\n",
       "1                            https://pypi.org/simple       18398\n",
       "2  https://tensorflow.pypi.thoth-station.ninja/in...         605\n",
       "3  https://tensorflow.pypi.thoth-station.ninja/in...         601\n",
       "4  https://tensorflow.pypi.thoth-station.ninja/in...         604\n",
       "5  https://tensorflow.pypi.thoth-station.ninja/in...         605\n",
       "6  https://tensorflow.pypi.thoth-station.ninja/in...         600"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.DataFrame(packages_per_index_list, columns = ['URL', 'N.packages'])\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T19:12:57.565369Z",
     "start_time": "2019-04-08T19:12:57.559588Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "22014"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sum([element[1] for element in packages_per_index_list])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T18:59:31.187031Z",
     "start_time": "2019-04-08T18:59:25.932894Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "22014"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gqr(g.V().has(\"index_url\").count().next()).result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T19:32:07.808946Z",
     "start_time": "2019-04-08T19:32:07.797981Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(set(all_url) - set(known_thoth_url))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T09:48:14.281859Z",
     "start_time": "2019-04-08T09:48:06.003377Z"
    }
   },
   "outputs": [],
   "source": [
    "# Extract all packages\n",
    "all_packages = gqr(\n",
    "    g.V()\n",
    "    .has('__label__', 'package')\n",
    "    .order().by('package_name')\n",
    "    .project('package').by('package_name')\n",
    "    .toList()\n",
    ").result"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's take a look at which python packages are inside Thoth "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T11:55:23.162297Z",
     "start_time": "2019-04-08T11:55:23.158027Z"
    },
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The number of packages for letter t is: 32\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Extract Packages for selected letter\n",
    "\n",
    "# Select a letter\n",
    "letter = 't'\n",
    "\n",
    "packages_list = [package['package'] for package in all_packages if package['package'][0] == letter]    \n",
    "print(f\"The number of packages for letter {letter} is: {len(packages_list)}\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T11:55:26.228352Z",
     "start_time": "2019-04-08T11:55:26.210118Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>t</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>tablib</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>tahoe-lafs</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>tb-nightly</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>telemeta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>tendenci</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>tensorboard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>tensorflow</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>tensorflow-estimator</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>termcolor</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>textract</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>tf-estimator-nightly</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>thorn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>tiddlyweb</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>tinydb</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>tlslite</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>tmc</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>toolz</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>tornado</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>toro</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>tox</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>tqdm</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>tracauthopenid</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>trash-cli</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>trio-websockets</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>tripleo-heat-templates</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>trosnoth</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>tryton</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>trytond</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>tuf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>tweepy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>twilio</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>typing</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         t\n",
       "0                   tablib\n",
       "1               tahoe-lafs\n",
       "2               tb-nightly\n",
       "3                 telemeta\n",
       "4                 tendenci\n",
       "5              tensorboard\n",
       "6               tensorflow\n",
       "7     tensorflow-estimator\n",
       "8                termcolor\n",
       "9                 textract\n",
       "10    tf-estimator-nightly\n",
       "11                   thorn\n",
       "12               tiddlyweb\n",
       "13                  tinydb\n",
       "14                 tlslite\n",
       "15                     tmc\n",
       "16                   toolz\n",
       "17                 tornado\n",
       "18                    toro\n",
       "19                     tox\n",
       "20                    tqdm\n",
       "21          tracauthopenid\n",
       "22               trash-cli\n",
       "23         trio-websockets\n",
       "24  tripleo-heat-templates\n",
       "25                trosnoth\n",
       "26                  tryton\n",
       "27                 trytond\n",
       "28                     tuf\n",
       "29                  tweepy\n",
       "30                  twilio\n",
       "31                  typing"
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Visualize packages for selected letter\n",
    "df = pd.DataFrame(packages_list, columns = [letter])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For the packages extracted, let's see how many versions are available"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:26:18.597185Z",
     "start_time": "2019-04-08T07:24:26.480149Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 59.9 ms, sys: 6.38 ms, total: 66.3 ms\n",
      "Wall time: 1min 52s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# Count all versions (Python and RPM) for the packages considered for the selected letter\n",
    "package_versions_results = []\n",
    "\n",
    "for package in packages_list:\n",
    "    \n",
    "    n_python_package_versions = gqr(g.V()\n",
    "                              .has(\"__label__\", \"package\")\n",
    "                              .has(\"package_name\", package)\n",
    "                              .outE()\n",
    "                              .has(\"__label__\",\"has_version\")\n",
    "                              .inV()\n",
    "                              .has('__label__', 'python_package_version')\n",
    "                              .count()\n",
    "                              .next()\n",
    "                             ).result\n",
    "    \n",
    "    n_rpm_package_versions = gqr(g.V()\n",
    "                          .has(\"__label__\", \"package\")\n",
    "                          .has(\"package_name\", package)\n",
    "                          .outE()\n",
    "                          .has(\"__label__\",\"has_version\")\n",
    "                          .inV()\n",
    "                          .has('__label__', 'rpm_package_version')\n",
    "                          .count()\n",
    "                          .next()\n",
    "                         ).result\n",
    "    \n",
    "    package_versions_results.append([package,\n",
    "                                 n_python_package_versions,\n",
    "                                 n_rpm_package_versions,\n",
    "                                 n_python_package_versions +  n_rpm_package_versions])\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:26:18.636000Z",
     "start_time": "2019-04-08T07:26:18.604239Z"
    },
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>package_name</th>\n",
       "      <th>n_python_package_version</th>\n",
       "      <th>n_rpm_package_version</th>\n",
       "      <th>total_package_versions</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>gandi-cli</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>gast</td>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>genshi</td>\n",
       "      <td>15</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>gevent</td>\n",
       "      <td>18</td>\n",
       "      <td>0</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>geventhttpclient</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>girder</td>\n",
       "      <td>49</td>\n",
       "      <td>0</td>\n",
       "      <td>49</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>gitlab-languages</td>\n",
       "      <td>12</td>\n",
       "      <td>0</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>gns3-gui</td>\n",
       "      <td>51</td>\n",
       "      <td>0</td>\n",
       "      <td>51</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>go-http</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>google-appengine</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>google-pasta</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>grpcio</td>\n",
       "      <td>55</td>\n",
       "      <td>0</td>\n",
       "      <td>55</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        package_name  n_python_package_version  n_rpm_package_version  \\\n",
       "0          gandi-cli                         3                      0   \n",
       "1               gast                         5                      0   \n",
       "2             genshi                        15                      0   \n",
       "3             gevent                        18                      0   \n",
       "4   geventhttpclient                         2                      0   \n",
       "5             girder                        49                      0   \n",
       "6   gitlab-languages                        12                      0   \n",
       "7           gns3-gui                        51                      0   \n",
       "8            go-http                         1                      0   \n",
       "9   google-appengine                         1                      0   \n",
       "10      google-pasta                         3                      0   \n",
       "11            grpcio                        55                      0   \n",
       "\n",
       "    total_package_versions  \n",
       "0                        3  \n",
       "1                        5  \n",
       "2                       15  \n",
       "3                       18  \n",
       "4                        2  \n",
       "5                       49  \n",
       "6                       12  \n",
       "7                       51  \n",
       "8                        1  \n",
       "9                        1  \n",
       "10                       3  \n",
       "11                      55  "
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Visualize packages for selected letter\n",
    "df = pd.DataFrame(package_versions_results, columns = ['package_name', 'n_python_package_version',\n",
    "                                                      'n_rpm_package_version', 'total_package_versions'])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Select one package and discover more about it"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T15:56:17.110025Z",
     "start_time": "2019-04-08T15:56:17.104314Z"
    }
   },
   "outputs": [],
   "source": [
    "# Select the package\n",
    "name_of_package = 'tensorflow'"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We retrieve all the versions available in Thoth's graph from any ecosystem for the selected package"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T15:56:24.454088Z",
     "start_time": "2019-04-08T15:56:19.648470Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 18.4 ms, sys: 1.85 ms, total: 20.2 ms\n",
      "Wall time: 4.75 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ecosystem</th>\n",
       "      <th>index_url</th>\n",
       "      <th>package</th>\n",
       "      <th>version</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>0.12.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>0.12.0rc0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>0.12.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>0.12.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.0.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.1.0rc0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.1.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.1.0rc2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.10.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.10.0rc0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.10.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.10.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.10.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.10.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.10.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.10.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.11.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.11.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.11.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.11.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.11.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.11.0rc2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.12.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.12.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.12.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.12.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.12.0rc0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.12.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.3.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.3.0rc2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.4.0rc0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.4.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.4.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.5.0rc0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.5.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.5.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.6.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.6.0rc0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.6.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.7.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.7.0rc0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.7.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.7.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>61</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.8.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.8.0rc0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.8.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.9.0rc0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.9.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>1.9.0rc2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>tensorflow</td>\n",
       "      <td>2.0.0a0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>74 rows  4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   ecosystem                                          index_url     package  \\\n",
       "0       pypi                            https://pypi.org/simple  tensorflow   \n",
       "1       pypi                            https://pypi.org/simple  tensorflow   \n",
       "2       pypi                            https://pypi.org/simple  tensorflow   \n",
       "3       pypi                            https://pypi.org/simple  tensorflow   \n",
       "4       pypi                            https://pypi.org/simple  tensorflow   \n",
       "5       pypi                            https://pypi.org/simple  tensorflow   \n",
       "6       pypi                            https://pypi.org/simple  tensorflow   \n",
       "7       pypi                            https://pypi.org/simple  tensorflow   \n",
       "8       pypi                            https://pypi.org/simple  tensorflow   \n",
       "9       pypi                            https://pypi.org/simple  tensorflow   \n",
       "10      pypi                            https://pypi.org/simple  tensorflow   \n",
       "11      pypi                            https://pypi.org/simple  tensorflow   \n",
       "12      pypi                            https://pypi.org/simple  tensorflow   \n",
       "13      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "14      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "15      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "16      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "17      pypi                            https://pypi.org/simple  tensorflow   \n",
       "18      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "19      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "20      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "21      pypi                            https://pypi.org/simple  tensorflow   \n",
       "22      pypi                            https://pypi.org/simple  tensorflow   \n",
       "23      pypi                            https://pypi.org/simple  tensorflow   \n",
       "24      pypi                            https://pypi.org/simple  tensorflow   \n",
       "25      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "26      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "27      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "28      pypi                            https://pypi.org/simple  tensorflow   \n",
       "29      pypi                            https://pypi.org/simple  tensorflow   \n",
       "..       ...                                                ...         ...   \n",
       "44      pypi                            https://pypi.org/simple  tensorflow   \n",
       "45      pypi                            https://pypi.org/simple  tensorflow   \n",
       "46      pypi                            https://pypi.org/simple  tensorflow   \n",
       "47      pypi                            https://pypi.org/simple  tensorflow   \n",
       "48      pypi                            https://pypi.org/simple  tensorflow   \n",
       "49      pypi                            https://pypi.org/simple  tensorflow   \n",
       "50      pypi                            https://pypi.org/simple  tensorflow   \n",
       "51      pypi                            https://pypi.org/simple  tensorflow   \n",
       "52      pypi                            https://pypi.org/simple  tensorflow   \n",
       "53      pypi                            https://pypi.org/simple  tensorflow   \n",
       "54      pypi                            https://pypi.org/simple  tensorflow   \n",
       "55      pypi                            https://pypi.org/simple  tensorflow   \n",
       "56      pypi                            https://pypi.org/simple  tensorflow   \n",
       "57      pypi                            https://pypi.org/simple  tensorflow   \n",
       "58      pypi                            https://pypi.org/simple  tensorflow   \n",
       "59      pypi                            https://pypi.org/simple  tensorflow   \n",
       "60      pypi                            https://pypi.org/simple  tensorflow   \n",
       "61      pypi                            https://pypi.org/simple  tensorflow   \n",
       "62      pypi                            https://pypi.org/simple  tensorflow   \n",
       "63      pypi                            https://pypi.org/simple  tensorflow   \n",
       "64      pypi                            https://pypi.org/simple  tensorflow   \n",
       "65      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "66      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "67      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "68      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "69      pypi  https://tensorflow.pypi.thoth-station.ninja/in...  tensorflow   \n",
       "70      pypi                            https://pypi.org/simple  tensorflow   \n",
       "71      pypi                            https://pypi.org/simple  tensorflow   \n",
       "72      pypi                            https://pypi.org/simple  tensorflow   \n",
       "73      pypi                            https://pypi.org/simple  tensorflow   \n",
       "\n",
       "      version  \n",
       "0      0.12.0  \n",
       "1   0.12.0rc0  \n",
       "2   0.12.0rc1  \n",
       "3      0.12.1  \n",
       "4       1.0.0  \n",
       "5       1.0.1  \n",
       "6       1.1.0  \n",
       "7    1.1.0rc0  \n",
       "8    1.1.0rc1  \n",
       "9    1.1.0rc2  \n",
       "10     1.10.0  \n",
       "11  1.10.0rc0  \n",
       "12  1.10.0rc1  \n",
       "13     1.10.1  \n",
       "14     1.10.1  \n",
       "15     1.10.1  \n",
       "16     1.10.1  \n",
       "17     1.10.1  \n",
       "18     1.11.0  \n",
       "19     1.11.0  \n",
       "20     1.11.0  \n",
       "21     1.11.0  \n",
       "22  1.11.0rc1  \n",
       "23  1.11.0rc2  \n",
       "24     1.12.0  \n",
       "25     1.12.0  \n",
       "26     1.12.0  \n",
       "27     1.12.0  \n",
       "28  1.12.0rc0  \n",
       "29  1.12.0rc1  \n",
       "..        ...  \n",
       "44   1.3.0rc1  \n",
       "45   1.3.0rc2  \n",
       "46      1.4.0  \n",
       "47   1.4.0rc0  \n",
       "48   1.4.0rc1  \n",
       "49      1.4.1  \n",
       "50      1.5.0  \n",
       "51   1.5.0rc0  \n",
       "52   1.5.0rc1  \n",
       "53      1.5.1  \n",
       "54      1.6.0  \n",
       "55   1.6.0rc0  \n",
       "56   1.6.0rc1  \n",
       "57      1.7.0  \n",
       "58   1.7.0rc0  \n",
       "59   1.7.0rc1  \n",
       "60      1.7.1  \n",
       "61      1.8.0  \n",
       "62   1.8.0rc0  \n",
       "63   1.8.0rc1  \n",
       "64      1.9.0  \n",
       "65      1.9.0  \n",
       "66      1.9.0  \n",
       "67      1.9.0  \n",
       "68      1.9.0  \n",
       "69      1.9.0  \n",
       "70   1.9.0rc0  \n",
       "71   1.9.0rc1  \n",
       "72   1.9.0rc2  \n",
       "73    2.0.0a0  \n",
       "\n",
       "[74 rows x 4 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "gqr(\n",
    "    g.V().\n",
    "    has('package_name', name_of_package)\n",
    "    .outE().has('__label__', 'has_version')\n",
    "    .inV()\n",
    "    .order().by('package_version')\n",
    "    .project('package', 'version', 'ecosystem','index_url')\n",
    "    .by('package_name').by('package_version').by('ecosystem').by('index_url')\n",
    "    .toList()\n",
    ").to_dataframe()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get all the direct dependencies for athe selected package regardless the version"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T15:56:36.714316Z",
     "start_time": "2019-04-08T15:56:31.593514Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>absl-py</th>\n",
       "      <th>astor</th>\n",
       "      <th>gast</th>\n",
       "      <th>google-pasta</th>\n",
       "      <th>grpcio</th>\n",
       "      <th>keras-applications</th>\n",
       "      <th>keras-preprocessing</th>\n",
       "      <th>numpy</th>\n",
       "      <th>protobuf</th>\n",
       "      <th>setuptools</th>\n",
       "      <th>six</th>\n",
       "      <th>tb-nightly</th>\n",
       "      <th>tensorboard</th>\n",
       "      <th>tensorflow-estimator</th>\n",
       "      <th>termcolor</th>\n",
       "      <th>tf-estimator-nightly</th>\n",
       "      <th>wheel</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[0.1.13, 0.2.2, 0.1.7, 0.5.0, 0.1.8, 0.1.9, 0....</td>\n",
       "      <td>[0.6, 0.7.0, 0.7.1, 0.6.2, 0.6.1]</td>\n",
       "      <td>[0.2.1.post1, 0.2.1.post0, 0.2.1, 0.2.0, 0.2.2]</td>\n",
       "      <td>[0.1.2, 0.1.3, 0.1.4]</td>\n",
       "      <td>[1.10.0rc1, 1.10.0, 1.11.0rc1, 1.11.1, 1.13.0,...</td>\n",
       "      <td>[1.0.6, 1.0.7, 1.0.5]</td>\n",
       "      <td>[1.0.5, 1.0.9, 1.0.6, 1.0.8, 1.0.3, 1.0.4]</td>\n",
       "      <td>[1.14.1, 1.14.3, 1.15.4, 1.16.0, 1.16.2, 1.15....</td>\n",
       "      <td>[3.7.0rc3, 3.7.0, 3.6.1, 3.7.0rc2, 3.6.0, 3.5....</td>\n",
       "      <td>[20.6.6, 8.2, 18.3.1, 18.0.1, 18.5, 18.7.1, 18...</td>\n",
       "      <td>[1.10.0, 1.11.0, 1.12.0]</td>\n",
       "      <td>[1.5.0a20171209, 1.5.0a20171210, 1.5.0a2017121...</td>\n",
       "      <td>[1.12.0, 1.0.0a2, 1.6.0rc0, 1.10.0, 1.0.0a5, 1...</td>\n",
       "      <td>[1.10.12, 1.13.0rc0, 1.13.0, 1.10.7, 1.10.8, 1...</td>\n",
       "      <td>[1.1.0]</td>\n",
       "      <td>[1.12.0.dev20181124, 1.12.0.dev20181204, 1.12....</td>\n",
       "      <td>[0.26.0, 0.32.3, 0.33.1, 0.30.0a0, 0.32.2, 0.3...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             absl-py  \\\n",
       "0  [0.1.13, 0.2.2, 0.1.7, 0.5.0, 0.1.8, 0.1.9, 0....   \n",
       "\n",
       "                               astor  \\\n",
       "0  [0.6, 0.7.0, 0.7.1, 0.6.2, 0.6.1]   \n",
       "\n",
       "                                              gast           google-pasta  \\\n",
       "0  [0.2.1.post1, 0.2.1.post0, 0.2.1, 0.2.0, 0.2.2]  [0.1.2, 0.1.3, 0.1.4]   \n",
       "\n",
       "                                              grpcio     keras-applications  \\\n",
       "0  [1.10.0rc1, 1.10.0, 1.11.0rc1, 1.11.1, 1.13.0,...  [1.0.6, 1.0.7, 1.0.5]   \n",
       "\n",
       "                          keras-preprocessing  \\\n",
       "0  [1.0.5, 1.0.9, 1.0.6, 1.0.8, 1.0.3, 1.0.4]   \n",
       "\n",
       "                                               numpy  \\\n",
       "0  [1.14.1, 1.14.3, 1.15.4, 1.16.0, 1.16.2, 1.15....   \n",
       "\n",
       "                                            protobuf  \\\n",
       "0  [3.7.0rc3, 3.7.0, 3.6.1, 3.7.0rc2, 3.6.0, 3.5....   \n",
       "\n",
       "                                          setuptools  \\\n",
       "0  [20.6.6, 8.2, 18.3.1, 18.0.1, 18.5, 18.7.1, 18...   \n",
       "\n",
       "                        six  \\\n",
       "0  [1.10.0, 1.11.0, 1.12.0]   \n",
       "\n",
       "                                          tb-nightly  \\\n",
       "0  [1.5.0a20171209, 1.5.0a20171210, 1.5.0a2017121...   \n",
       "\n",
       "                                         tensorboard  \\\n",
       "0  [1.12.0, 1.0.0a2, 1.6.0rc0, 1.10.0, 1.0.0a5, 1...   \n",
       "\n",
       "                                tensorflow-estimator termcolor  \\\n",
       "0  [1.10.12, 1.13.0rc0, 1.13.0, 1.10.7, 1.10.8, 1...   [1.1.0]   \n",
       "\n",
       "                                tf-estimator-nightly  \\\n",
       "0  [1.12.0.dev20181124, 1.12.0.dev20181204, 1.12....   \n",
       "\n",
       "                                               wheel  \n",
       "0  [0.26.0, 0.32.3, 0.33.1, 0.30.0a0, 0.32.2, 0.3...  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gqr(\n",
    "    g.V()\n",
    "    .has('__label__', 'python_package_version')\n",
    "    .has('package_name', name_of_package)\n",
    "    .outE().has('__label__', 'depends_on')\n",
    "    .inV()\n",
    "    .dedup()\n",
    "    .group().by('package_name').by('package_version')\n",
    "    .toList()\n",
    ").to_dataframe()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.8"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": true,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
