{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "toc": true
   },
   "source": [
    "<h1>Table of Contents<span class=\"tocSkip\"></span></h1>\n",
    "<div class=\"toc\"><ul class=\"toc-item\"><li><span><a href=\"#Discover-Thoth's-Graph-Structure\" data-toc-modified-id=\"Discover-Thoth's-Graph-Structure-1\"><span class=\"toc-item-num\">1&nbsp;&nbsp;</span>Discover Thoth's Graph Structure</a></span><ul class=\"toc-item\"><li><span><a href=\"#Connect-to-JanusGraph-Instance\" data-toc-modified-id=\"Connect-to-JanusGraph-Instance-1.1\"><span class=\"toc-item-num\">1.1&nbsp;&nbsp;</span>Connect to JanusGraph Instance</a></span></li><li><span><a href=\"#Vertex-and-Edge-Labels\" data-toc-modified-id=\"Vertex-and-Edge-Labels-1.2\"><span class=\"toc-item-num\">1.2&nbsp;&nbsp;</span>Vertex and Edge Labels</a></span></li><li><span><a href=\"#Vertex-and-Edge-Instances\" data-toc-modified-id=\"Vertex-and-Edge-Instances-1.3\"><span class=\"toc-item-num\">1.3&nbsp;&nbsp;</span>Vertex and Edge Instances</a></span></li></ul></li><li><span><a href=\"#Discover-the-packages-inside-Thoth\" data-toc-modified-id=\"Discover-the-packages-inside-Thoth-2\"><span class=\"toc-item-num\">2&nbsp;&nbsp;</span>Discover the packages inside Thoth</a></span></li><li><span><a href=\"#Select-one-package-and-discover-more-about-it\" data-toc-modified-id=\"Select-one-package-and-discover-more-about-it-3\"><span class=\"toc-item-num\">3&nbsp;&nbsp;</span>Select one package and discover more about it</a></span></li><li><span><a href=\"#Inspect-packages\" data-toc-modified-id=\"Inspect-packages-4\"><span class=\"toc-item-num\">4&nbsp;&nbsp;</span>Inspect packages</a></span></li></ul></div>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Discover Thoth's Graph Structure"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This notebook is addressed to users and developers of Thoth that want to discover the content of Thoth's Graph Database."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "First it's important to look at schema model of Thoth Graph Database."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T09:54:19.843806Z",
     "start_time": "2019-04-08T09:54:19.718428Z"
    }
   },
   "source": [
    "![Thoth Graph Database](https://raw.githubusercontent.com/thoth-station/storages/master/docs/schema.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Connect to JanusGraph Instance"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In order to discover what is inside the Graph Database, we need to connect to JanusGraph instance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T14:02:01.268127Z",
     "start_time": "2019-04-08T14:02:00.154753Z"
    }
   },
   "outputs": [],
   "source": [
    "from thoth.storages.graph import GraphDatabase\n",
    "from thoth.lab import GraphQueryResult as gqr\n",
    "\n",
    "graph_db = GraphDatabase.create('janusgraph.test.thoth-station.ninja', port=8182)\n",
    "graph_db.connect()\n",
    "g = graph_db.g   # We will use raw Gremlin traversal in examples."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We need to import objects that will be used in the notebook"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T14:02:03.530527Z",
     "start_time": "2019-04-08T14:02:03.213878Z"
    }
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from pprint import pprint\n",
    "from thoth.solver import pip_compile\n",
    "from thoth.storages.graph.models import ALL_MODELS\n",
    "from gremlin_python.process.graph_traversal import has\n",
    "from gremlin_python.process.traversal import Operator\n",
    "from gremlin_python.process.traversal import Pop\n",
    "from gremlin_python.process.traversal import not_\n",
    "from gremlin_python.process.traversal import P\n",
    "from gremlin_python.process.graph_traversal import identity\n",
    "from gremlin_python.process.graph_traversal import path\n",
    "from gremlin_python.process.graph_traversal import outE\n",
    "from gremlin_python.process.graph_traversal import out\n",
    "from gremlin_python.process.graph_traversal import inE\n",
    "from gremlin_python.process.graph_traversal import inV\n",
    "from gremlin_python.process.graph_traversal import select\n",
    "from gremlin_python.process.graph_traversal import values\n",
    "from gremlin_python.process.graph_traversal import fold\n",
    "from gremlin_python.process.graph_traversal import constant\n",
    "from gremlin_python.process.graph_traversal import project"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Vertex and Edge Labels"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "List all the available vertex labels in the graph database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:03:32.061323Z",
     "start_time": "2019-04-08T07:03:32.039951Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Vertex</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>cve</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>inspection_software_stack</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>software_stack_observation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>adviser_software_stack</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>rpm_requirement</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>buildtime_environment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>python_artifact</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>python_package_index</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>deb_package_version</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>user_software_stack</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>build_observation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>hardware_information</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ecosystem_solver</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>rpm_package_version</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>package</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>runtime_environment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>python_package_version</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        Vertex\n",
       "0                          cve\n",
       "1    inspection_software_stack\n",
       "2   software_stack_observation\n",
       "3       adviser_software_stack\n",
       "4              rpm_requirement\n",
       "5        buildtime_environment\n",
       "6              python_artifact\n",
       "7         python_package_index\n",
       "8          deb_package_version\n",
       "9          user_software_stack\n",
       "10           build_observation\n",
       "11        hardware_information\n",
       "12            ecosystem_solver\n",
       "13         rpm_package_version\n",
       "14                     package\n",
       "15         runtime_environment\n",
       "16      python_package_version"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create list of vertices \n",
    "vertex_labels = []\n",
    "for element in ALL_MODELS:\n",
    "\n",
    "    if element.__type__ == \"vertex\":\n",
    "        vertex_labels.append(element.__label__)\n",
    "        \n",
    "# Create the pandas DataFrame \n",
    "df = pd.DataFrame(vertex_labels, columns = ['Vertex'])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "List all the available edge labels in the graph database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:03:39.815981Z",
     "start_time": "2019-04-08T07:03:39.803593Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Edge</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>runs_in</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>has_artifact</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>observed</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>deb_pre_depends</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>requires</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>builds_on</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>solved</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>depends_on</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>runs_on</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>has_version</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>creates_stack</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>is_part_of</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>deb_replaces</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>builds_in</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>deb_depends</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>has_vulnerability</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 Edge\n",
       "0             runs_in\n",
       "1        has_artifact\n",
       "2            observed\n",
       "3     deb_pre_depends\n",
       "4            requires\n",
       "5           builds_on\n",
       "6              solved\n",
       "7          depends_on\n",
       "8             runs_on\n",
       "9         has_version\n",
       "10      creates_stack\n",
       "11         is_part_of\n",
       "12       deb_replaces\n",
       "13          builds_in\n",
       "14        deb_depends\n",
       "15  has_vulnerability"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create list of edges\n",
    "edge_labels = []\n",
    "for element in ALL_MODELS:\n",
    "\n",
    "    if element.__type__ == \"edge\":\n",
    "        edge_labels.append(element.__label__)\n",
    "        \n",
    "# Create the pandas DataFrame \n",
    "df = pd.DataFrame(edge_labels, columns = ['Edge'])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Vertex and Edge Instances"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's have an idea of the size of Thoth's Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:03:54.382766Z",
     "start_time": "2019-04-08T07:03:43.607917Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of vertex instances in the graph database: 39865\n",
      "Number of edge instances in the graph database: 637271\n"
     ]
    }
   ],
   "source": [
    "print(f\"Number of vertex instances in the graph database: {gqr(g.V().count().next()).result:d}\")\n",
    "print(f\"Number of edge instances in the graph database: {gqr(g.E().count().next()).result:d}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's see which vertex label has more instances"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:06:13.314279Z",
     "start_time": "2019-04-08T07:06:07.018272Z"
    },
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Number of vertex instances present in the graph database (sum): 39864\n",
      "Number of vertex instances present in the graph database: 39865\n"
     ]
    }
   ],
   "source": [
    "# Extract the number of instances for each vertex label\n",
    "\n",
    "# List of vertex labels\n",
    "vertex_labels = [element.__label__ for element in ALL_MODELS if element.__type__ == \"vertex\"]\n",
    "\n",
    "# Dict of vertex labels and counts \n",
    "vertices_number = gqr(g.V().has(\"__type__\", \"vertex\").groupCount().by(\"__label__\").next()).result\n",
    "\n",
    "list_vertices_counts = []\n",
    "\n",
    "for vertex in vertex_labels:\n",
    "    \n",
    "    if vertex in vertices_number.keys():\n",
    "        \n",
    "        list_vertices_counts.append([vertex, vertices_number[vertex]])\n",
    "        \n",
    "    else:\n",
    "        list_vertices_counts.append([vertex, 0])\n",
    "        \n",
    "\n",
    "print(f\"\\nNumber of vertex instances present in the graph database (sum): {sum(vertex_c[1] for vertex_c in list_vertices_counts)}\")\n",
    "print(f\"Number of vertex instances present in the graph database: {gqr(graph_db.g.V().count().next()).result:d}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:08:36.137925Z",
     "start_time": "2019-04-08T07:08:36.124870Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Vertex</th>\n",
       "      <th>N. Instances</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>python_package_version</td>\n",
       "      <td>22015</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>python_artifact</td>\n",
       "      <td>15407</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>package</td>\n",
       "      <td>946</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>cve</td>\n",
       "      <td>796</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>rpm_requirement</td>\n",
       "      <td>513</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>rpm_package_version</td>\n",
       "      <td>174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>python_package_index</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ecosystem_solver</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>buildtime_environment</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>runtime_environment</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>adviser_software_stack</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>inspection_software_stack</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>user_software_stack</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>build_observation</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>hardware_information</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>software_stack_observation</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>deb_package_version</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        Vertex  N. Instances\n",
       "16      python_package_version         22015\n",
       "6              python_artifact         15407\n",
       "14                     package           946\n",
       "0                          cve           796\n",
       "4              rpm_requirement           513\n",
       "13         rpm_package_version           174\n",
       "7         python_package_index             7\n",
       "12            ecosystem_solver             4\n",
       "5        buildtime_environment             1\n",
       "15         runtime_environment             1\n",
       "3       adviser_software_stack             0\n",
       "1    inspection_software_stack             0\n",
       "9          user_software_stack             0\n",
       "10           build_observation             0\n",
       "11        hardware_information             0\n",
       "2   software_stack_observation             0\n",
       "8          deb_package_version             0"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Show the number of instances for each vertex label\n",
    "df = pd.DataFrame(list_vertices_counts, columns = ['Vertex', 'N. Instances']).sort_values(by='N. Instances',ascending=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's see which edge label has more instances"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:05:56.414463Z",
     "start_time": "2019-04-08T07:05:34.521986Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Number of edge instances present in the graph database (sum): 637271\n",
      "Number of edge instances present in the graph database: 637271\n"
     ]
    }
   ],
   "source": [
    "# List of edge labels\n",
    "edge_labels = [element.__label__ for element in ALL_MODELS if element.__type__ == \"edge\"]\n",
    "\n",
    "# Dict of edge labels and counts \n",
    "edges_number = gqr(g.E().has(\"__type__\", \"edge\").groupCount().by(\"__label__\").next()).result\n",
    "\n",
    "list_edges_counts = []\n",
    "\n",
    "for edge in edge_labels:\n",
    "    \n",
    "    if edge in edges_number.keys():\n",
    "        \n",
    "        list_edges_counts.append([edge, edges_number[edge]])\n",
    "        \n",
    "    else:\n",
    "        list_edges_counts.append([edge, 0])\n",
    "        \n",
    "\n",
    "print(f\"\\nNumber of edge instances present in the graph database (sum): {sum(edge_c[1] for edge_c in list_edges_counts)}\")\n",
    "print(f\"Number of edge instances present in the graph database: {gqr(graph_db.g.E().count().next()).result:d}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:08:40.966892Z",
     "start_time": "2019-04-08T07:08:40.953871Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Edge</th>\n",
       "      <th>N. Instances</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>solved</td>\n",
       "      <td>405001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>depends_on</td>\n",
       "      <td>156006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>has_vulnerability</td>\n",
       "      <td>34810</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>has_version</td>\n",
       "      <td>22283</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>has_artifact</td>\n",
       "      <td>15557</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>requires</td>\n",
       "      <td>3350</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>is_part_of</td>\n",
       "      <td>264</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>runs_in</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>observed</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>deb_pre_depends</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>builds_on</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>runs_on</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>creates_stack</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>deb_replaces</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>builds_in</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>deb_depends</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 Edge  N. Instances\n",
       "6              solved        405001\n",
       "7          depends_on        156006\n",
       "15  has_vulnerability         34810\n",
       "9         has_version         22283\n",
       "1        has_artifact         15557\n",
       "4            requires          3350\n",
       "11         is_part_of           264\n",
       "0             runs_in             0\n",
       "2            observed             0\n",
       "3     deb_pre_depends             0\n",
       "5           builds_on             0\n",
       "8             runs_on             0\n",
       "10      creates_stack             0\n",
       "12       deb_replaces             0\n",
       "13          builds_in             0\n",
       "14        deb_depends             0"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Show the number of instances for each vertex label\n",
    "df = pd.DataFrame(list_edges_counts, columns = ['Edge', 'N. Instances']).sort_values(by='N. Instances',ascending=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Looking at the relations between vertices which are currently instanciated"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T09:47:10.701974Z",
     "start_time": "2019-04-08T09:46:47.373955Z"
    }
   },
   "outputs": [],
   "source": [
    "vertex_edge_vertex = gqr(g.V().outE().otherV().groupCount().by(path().by(\"__label__\")).next()).result\n",
    "vertex_edge_vertex_list = []\n",
    "for triple_string, counts in vertex_edge_vertex.items():\n",
    "    triple = triple_string.lstrip(\"[\").rstrip(\"]\").replace(\" \",\"\").split(\",\")\n",
    "    vertex_edge_vertex_list.append([str(triple[0]), str(triple[1]), str(triple[2]), counts])\n",
    "vertex_edge_vertex_list.sort(key=lambda x: x[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T09:47:10.743304Z",
     "start_time": "2019-04-08T09:47:10.706735Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>VERTEX</th>\n",
       "      <th>EDGE</th>\n",
       "      <th>VERTEX</th>\n",
       "      <th>COUNTS</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ecosystem_solver</td>\n",
       "      <td>solved</td>\n",
       "      <td>python_package_version</td>\n",
       "      <td>405001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>package</td>\n",
       "      <td>has_version</td>\n",
       "      <td>rpm_package_version</td>\n",
       "      <td>267</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>package</td>\n",
       "      <td>has_version</td>\n",
       "      <td>python_package_version</td>\n",
       "      <td>22016</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>python_package_version</td>\n",
       "      <td>depends_on</td>\n",
       "      <td>python_package_version</td>\n",
       "      <td>156006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>python_package_version</td>\n",
       "      <td>has_vulnerability</td>\n",
       "      <td>cve</td>\n",
       "      <td>34810</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>python_package_version</td>\n",
       "      <td>is_part_of</td>\n",
       "      <td>buildtime_environment</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>python_package_version</td>\n",
       "      <td>has_artifact</td>\n",
       "      <td>python_artifact</td>\n",
       "      <td>15557</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>rpm_package_version</td>\n",
       "      <td>requires</td>\n",
       "      <td>rpm_requirement</td>\n",
       "      <td>3350</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>rpm_package_version</td>\n",
       "      <td>is_part_of</td>\n",
       "      <td>buildtime_environment</td>\n",
       "      <td>174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>rpm_package_version</td>\n",
       "      <td>is_part_of</td>\n",
       "      <td>runtime_environment</td>\n",
       "      <td>89</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   VERTEX               EDGE                  VERTEX  COUNTS\n",
       "0        ecosystem_solver             solved  python_package_version  405001\n",
       "1                 package        has_version     rpm_package_version     267\n",
       "2                 package        has_version  python_package_version   22016\n",
       "3  python_package_version         depends_on  python_package_version  156006\n",
       "4  python_package_version  has_vulnerability                     cve   34810\n",
       "5  python_package_version         is_part_of   buildtime_environment       1\n",
       "6  python_package_version       has_artifact         python_artifact   15557\n",
       "7     rpm_package_version           requires         rpm_requirement    3350\n",
       "8     rpm_package_version         is_part_of   buildtime_environment     174\n",
       "9     rpm_package_version         is_part_of     runtime_environment      89"
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.DataFrame(vertex_edge_vertex_list, columns = ['VERTEX','EDGE','VERTEX', 'COUNTS'])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Discover the packages inside Thoth"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Check the allowed sources for the packages inside Thoth database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:24:09.883891Z",
     "start_time": "2019-04-08T07:24:02.946500Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>URL</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>https://tensorflow.pypi.thoth-station.ninja/in...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 URL\n",
       "0                            https://pypi.org/simple\n",
       "1  https://tensorflow.pypi.thoth-station.ninja/in...\n",
       "2  https://tensorflow.pypi.thoth-station.ninja/in...\n",
       "3  https://tensorflow.pypi.thoth-station.ninja/in...\n",
       "4  https://tensorflow.pypi.thoth-station.ninja/in...\n",
       "5  https://tensorflow.pypi.thoth-station.ninja/in...\n",
       "6  https://tensorflow.pypi.thoth-station.ninja/in..."
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "urls_list = graph_db.get_python_package_index_urls()\n",
    "\n",
    "df = pd.DataFrame(urls_list, columns = ['URL'])\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T09:48:14.281859Z",
     "start_time": "2019-04-08T09:48:06.003377Z"
    }
   },
   "outputs": [],
   "source": [
    "# Extract all packages\n",
    "all_packages = gqr(\n",
    "    g.V()\n",
    "    .has('__label__', 'package')\n",
    "    .order().by('package_name')\n",
    "    .project('package').by('package_name')\n",
    "    .toList()\n",
    ").result"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's take a look at which python packages are inside Thoth "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T11:55:23.162297Z",
     "start_time": "2019-04-08T11:55:23.158027Z"
    },
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The number of packages for letter t is: 32\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Extract Packages for selected letter\n",
    "\n",
    "# Select a letter\n",
    "letter = 't'\n",
    "\n",
    "packages_list = [package['package'] for package in all_packages if package['package'][0] == letter]    \n",
    "print(f\"The number of packages for letter {letter} is: {len(packages_list)}\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T11:55:26.228352Z",
     "start_time": "2019-04-08T11:55:26.210118Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>t</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>tablib</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>tahoe-lafs</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>tb-nightly</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>telemeta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>tendenci</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>tensorboard</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>tensorflow</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>tensorflow-estimator</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>termcolor</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>textract</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>tf-estimator-nightly</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>thorn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>tiddlyweb</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>tinydb</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>tlslite</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>tmc</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>toolz</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>tornado</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>toro</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>tox</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>tqdm</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>tracauthopenid</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>trash-cli</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>trio-websockets</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>tripleo-heat-templates</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>trosnoth</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>tryton</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>trytond</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>tuf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>tweepy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>twilio</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>typing</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         t\n",
       "0                   tablib\n",
       "1               tahoe-lafs\n",
       "2               tb-nightly\n",
       "3                 telemeta\n",
       "4                 tendenci\n",
       "5              tensorboard\n",
       "6               tensorflow\n",
       "7     tensorflow-estimator\n",
       "8                termcolor\n",
       "9                 textract\n",
       "10    tf-estimator-nightly\n",
       "11                   thorn\n",
       "12               tiddlyweb\n",
       "13                  tinydb\n",
       "14                 tlslite\n",
       "15                     tmc\n",
       "16                   toolz\n",
       "17                 tornado\n",
       "18                    toro\n",
       "19                     tox\n",
       "20                    tqdm\n",
       "21          tracauthopenid\n",
       "22               trash-cli\n",
       "23         trio-websockets\n",
       "24  tripleo-heat-templates\n",
       "25                trosnoth\n",
       "26                  tryton\n",
       "27                 trytond\n",
       "28                     tuf\n",
       "29                  tweepy\n",
       "30                  twilio\n",
       "31                  typing"
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Visualize packages for selected letter\n",
    "df = pd.DataFrame(packages_list, columns = [letter])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For the packages extracted, let's see how many versions are available"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:26:18.597185Z",
     "start_time": "2019-04-08T07:24:26.480149Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 59.9 ms, sys: 6.38 ms, total: 66.3 ms\n",
      "Wall time: 1min 52s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# Count all package versions (Python and RPM)\n",
    "package_versions_results = []\n",
    "\n",
    "for package in packages_list:\n",
    "    \n",
    "    n_python_package_versions = gqr(g.V()\n",
    "                              .has(\"__label__\", \"package\")\n",
    "                              .has(\"package_name\", package)\n",
    "                              .outE()\n",
    "                              .has(\"__label__\",\"has_version\")\n",
    "                              .inV()\n",
    "                              .has('__label__', 'python_package_version')\n",
    "                              .count()\n",
    "                              .next()\n",
    "                             ).result\n",
    "    \n",
    "    n_rpm_package_versions = gqr(g.V()\n",
    "                          .has(\"__label__\", \"package\")\n",
    "                          .has(\"package_name\", package)\n",
    "                          .outE()\n",
    "                          .has(\"__label__\",\"has_version\")\n",
    "                          .inV()\n",
    "                          .has('__label__', 'rpm_package_version')\n",
    "                          .count()\n",
    "                          .next()\n",
    "                         ).result\n",
    "    \n",
    "    package_versions_results.append([package,\n",
    "                                 n_python_package_versions,\n",
    "                                 n_rpm_package_versions,\n",
    "                                 n_python_package_versions +  n_rpm_package_versions])\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:26:18.636000Z",
     "start_time": "2019-04-08T07:26:18.604239Z"
    },
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>package_name</th>\n",
       "      <th>n_python_package_version</th>\n",
       "      <th>n_rpm_package_version</th>\n",
       "      <th>total_package_versions</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>gandi-cli</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>gast</td>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>genshi</td>\n",
       "      <td>15</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>gevent</td>\n",
       "      <td>18</td>\n",
       "      <td>0</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>geventhttpclient</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>girder</td>\n",
       "      <td>49</td>\n",
       "      <td>0</td>\n",
       "      <td>49</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>gitlab-languages</td>\n",
       "      <td>12</td>\n",
       "      <td>0</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>gns3-gui</td>\n",
       "      <td>51</td>\n",
       "      <td>0</td>\n",
       "      <td>51</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>go-http</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>google-appengine</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>google-pasta</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>grpcio</td>\n",
       "      <td>55</td>\n",
       "      <td>0</td>\n",
       "      <td>55</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        package_name  n_python_package_version  n_rpm_package_version  \\\n",
       "0          gandi-cli                         3                      0   \n",
       "1               gast                         5                      0   \n",
       "2             genshi                        15                      0   \n",
       "3             gevent                        18                      0   \n",
       "4   geventhttpclient                         2                      0   \n",
       "5             girder                        49                      0   \n",
       "6   gitlab-languages                        12                      0   \n",
       "7           gns3-gui                        51                      0   \n",
       "8            go-http                         1                      0   \n",
       "9   google-appengine                         1                      0   \n",
       "10      google-pasta                         3                      0   \n",
       "11            grpcio                        55                      0   \n",
       "\n",
       "    total_package_versions  \n",
       "0                        3  \n",
       "1                        5  \n",
       "2                       15  \n",
       "3                       18  \n",
       "4                        2  \n",
       "5                       49  \n",
       "6                       12  \n",
       "7                       51  \n",
       "8                        1  \n",
       "9                        1  \n",
       "10                       3  \n",
       "11                      55  "
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Visualize packages for selected letter\n",
    "df = pd.DataFrame(package_versions_results, columns = ['package_name', 'n_python_package_version',\n",
    "                                                      'n_rpm_package_version', 'total_package_versions'])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Select one package and discover more about it"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:36:53.638129Z",
     "start_time": "2019-04-08T07:36:53.632941Z"
    }
   },
   "outputs": [],
   "source": [
    "# Select the package\n",
    "name_of_package = 'grpcio'"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We retrieve all the versions available in Thoth's graph from any ecosystem for the selected package"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:32:49.080446Z",
     "start_time": "2019-04-08T07:32:44.074074Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 7.81 ms, sys: 1.32 ms, total: 9.13 ms\n",
      "Wall time: 4.98 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ecosystem</th>\n",
       "      <th>index_url</th>\n",
       "      <th>package</th>\n",
       "      <th>version</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.10.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.10.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.10.0rc2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.10.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.10.1rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.10.1rc2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.11.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.11.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.11.0rc2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.11.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.11.1rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.12.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.12.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.12.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.13.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.13.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.13.0rc2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.13.0rc3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.14.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.14.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.14.0rc2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.14.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.14.2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.14.2rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.15.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.15.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.16.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.16.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.16.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.16.1rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.17.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.17.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.17.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.17.1rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.18.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.18.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.19.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.19.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.6.3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.7.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.7.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.7.3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.8.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.8.0rc2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.8.0rc3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.8.1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.8.2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.8.3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.8.4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.8.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.9.0rc1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.9.0rc2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.9.0rc3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>pypi</td>\n",
       "      <td>https://pypi.org/simple</td>\n",
       "      <td>grpcio</td>\n",
       "      <td>1.9.1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   ecosystem                index_url package    version\n",
       "0       pypi  https://pypi.org/simple  grpcio     1.10.0\n",
       "1       pypi  https://pypi.org/simple  grpcio  1.10.0rc1\n",
       "2       pypi  https://pypi.org/simple  grpcio  1.10.0rc2\n",
       "3       pypi  https://pypi.org/simple  grpcio     1.10.1\n",
       "4       pypi  https://pypi.org/simple  grpcio  1.10.1rc1\n",
       "5       pypi  https://pypi.org/simple  grpcio  1.10.1rc2\n",
       "6       pypi  https://pypi.org/simple  grpcio     1.11.0\n",
       "7       pypi  https://pypi.org/simple  grpcio  1.11.0rc1\n",
       "8       pypi  https://pypi.org/simple  grpcio  1.11.0rc2\n",
       "9       pypi  https://pypi.org/simple  grpcio     1.11.1\n",
       "10      pypi  https://pypi.org/simple  grpcio  1.11.1rc1\n",
       "11      pypi  https://pypi.org/simple  grpcio     1.12.0\n",
       "12      pypi  https://pypi.org/simple  grpcio  1.12.0rc1\n",
       "13      pypi  https://pypi.org/simple  grpcio     1.12.1\n",
       "14      pypi  https://pypi.org/simple  grpcio     1.13.0\n",
       "15      pypi  https://pypi.org/simple  grpcio  1.13.0rc1\n",
       "16      pypi  https://pypi.org/simple  grpcio  1.13.0rc2\n",
       "17      pypi  https://pypi.org/simple  grpcio  1.13.0rc3\n",
       "18      pypi  https://pypi.org/simple  grpcio     1.14.0\n",
       "19      pypi  https://pypi.org/simple  grpcio  1.14.0rc1\n",
       "20      pypi  https://pypi.org/simple  grpcio  1.14.0rc2\n",
       "21      pypi  https://pypi.org/simple  grpcio     1.14.1\n",
       "22      pypi  https://pypi.org/simple  grpcio     1.14.2\n",
       "23      pypi  https://pypi.org/simple  grpcio  1.14.2rc1\n",
       "24      pypi  https://pypi.org/simple  grpcio     1.15.0\n",
       "25      pypi  https://pypi.org/simple  grpcio  1.15.0rc1\n",
       "26      pypi  https://pypi.org/simple  grpcio     1.16.0\n",
       "27      pypi  https://pypi.org/simple  grpcio  1.16.0rc1\n",
       "28      pypi  https://pypi.org/simple  grpcio     1.16.1\n",
       "29      pypi  https://pypi.org/simple  grpcio  1.16.1rc1\n",
       "30      pypi  https://pypi.org/simple  grpcio     1.17.0\n",
       "31      pypi  https://pypi.org/simple  grpcio  1.17.0rc1\n",
       "32      pypi  https://pypi.org/simple  grpcio     1.17.1\n",
       "33      pypi  https://pypi.org/simple  grpcio  1.17.1rc1\n",
       "34      pypi  https://pypi.org/simple  grpcio     1.18.0\n",
       "35      pypi  https://pypi.org/simple  grpcio  1.18.0rc1\n",
       "36      pypi  https://pypi.org/simple  grpcio     1.19.0\n",
       "37      pypi  https://pypi.org/simple  grpcio  1.19.0rc1\n",
       "38      pypi  https://pypi.org/simple  grpcio      1.6.3\n",
       "39      pypi  https://pypi.org/simple  grpcio      1.7.0\n",
       "40      pypi  https://pypi.org/simple  grpcio   1.7.0rc1\n",
       "41      pypi  https://pypi.org/simple  grpcio      1.7.3\n",
       "42      pypi  https://pypi.org/simple  grpcio   1.8.0rc1\n",
       "43      pypi  https://pypi.org/simple  grpcio   1.8.0rc2\n",
       "44      pypi  https://pypi.org/simple  grpcio   1.8.0rc3\n",
       "45      pypi  https://pypi.org/simple  grpcio      1.8.1\n",
       "46      pypi  https://pypi.org/simple  grpcio      1.8.2\n",
       "47      pypi  https://pypi.org/simple  grpcio      1.8.3\n",
       "48      pypi  https://pypi.org/simple  grpcio      1.8.4\n",
       "49      pypi  https://pypi.org/simple  grpcio      1.8.6\n",
       "50      pypi  https://pypi.org/simple  grpcio      1.9.0\n",
       "51      pypi  https://pypi.org/simple  grpcio   1.9.0rc1\n",
       "52      pypi  https://pypi.org/simple  grpcio   1.9.0rc2\n",
       "53      pypi  https://pypi.org/simple  grpcio   1.9.0rc3\n",
       "54      pypi  https://pypi.org/simple  grpcio      1.9.1"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "gqr(\n",
    "    g.V().\n",
    "    has('package_name', name_of_package)\n",
    "    .outE().has('__label__', 'has_version')\n",
    "    .inV()\n",
    "    .order().by('package_version')\n",
    "    .project('package', 'version', 'ecosystem','index_url')\n",
    "    .by('package_name').by('package_version').by('ecosystem').by('index_url')\n",
    "    .toList()\n",
    ").to_dataframe()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get all the direct dependencies for athe selected package regardless the version"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {
    "ExecuteTime": {
     "end_time": "2019-04-08T07:41:23.056851Z",
     "start_time": "2019-04-08T07:41:18.045017Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>protobuf</th>\n",
       "      <th>six</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[3.7.0rc3, 3.7.0, 3.5.1, 3.6.0, 3.6.1, 3.7.0rc...</td>\n",
       "      <td>[1.5.2, 1.7.3, 1.10.0, 1.6.0, 1.6.1, 1.7.1, 1....</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            protobuf  \\\n",
       "0  [3.7.0rc3, 3.7.0, 3.5.1, 3.6.0, 3.6.1, 3.7.0rc...   \n",
       "\n",
       "                                                 six  \n",
       "0  [1.5.2, 1.7.3, 1.10.0, 1.6.0, 1.6.1, 1.7.1, 1....  "
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gqr(\n",
    "    g.V()\n",
    "    .has('__label__', 'python_package_version')\n",
    "    .has('package_name', name_of_package)\n",
    "    .outE().has('__label__', 'depends_on')\n",
    "    .inV()\n",
    "    .dedup()\n",
    "    .group().by('package_name').by('package_version')\n",
    "    .toList()\n",
    ").to_dataframe()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.8"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": true,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
