{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Accesing and querying JanusGraph database"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This notebook demonstrates how to create a connection to the graph database, how to query the graph database and how to visualize graph query results.\n",
    "\n",
    "\n",
    "Let's start with imports and connection to JanusGraph database:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 80,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from thoth.lab import obtain_location\n",
    "from thoth.storages import GraphDatabase\n",
    "from thoth.lab import GraphQueryResult as gqr\n",
    "\n",
    "# Let's obtain location of our JanusGraph instance.\n",
    "JANUSGRAPH_LOCATION = obtain_location(\n",
    "    \"thoth-test-core-janusgraph\",  # name of JanusGraph instance\n",
    "    verify=False,            # do not verify TLS on internal network\n",
    "    only_netloc=True         # do not use http schema, use netloc instead\n",
    ")\n",
    "\n",
    "# Instantiate and connect the JanusGraph database\n",
    "adapter = GraphDatabase.create('10.8.253.255', port=8182)\n",
    "adapter.connect()\n",
    "\n",
    "adapter.is_connected()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Next, let's try to perform some generic queries. We will use `GraphQueryResult` wrapper that wraps our graph queries and exposes some useful methods for us:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 5.48 ms, sys: 596 µs, total: 6.07 ms\n",
      "Wall time: 836 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "\n",
    "query = adapter.g.V().has('__label__', 'python_package_version').has('__type__', 'vertex').groupCount().by('package_name').next()\n",
    "query_result = gqr(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "If we would like to access raw response, we can do so by acessing the result attribute:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'tzlocal': 1,\n",
       " 'pycparser': 1,\n",
       " 'markupsafe': 2,\n",
       " 'redis': 1,\n",
       " 'fedmsg': 1,\n",
       " 'pyasn1-modules': 1,\n",
       " 'stomper': 1,\n",
       " 'moksha.common': 1,\n",
       " 'lxml': 1,\n",
       " 'docutils': 1,\n",
       " 'm2crypto': 1,\n",
       " 'werkzeug': 1,\n",
       " 'click': 1,\n",
       " 'sqlalchemy': 1,\n",
       " 'pyyaml': 2,\n",
       " 'prettytable': 1,\n",
       " 'boto3': 1,\n",
       " 'pyliblzma': 1,\n",
       " 'pygithub': 1,\n",
       " 'idna': 1,\n",
       " 'decorator': 1,\n",
       " 'python-daemon': 2,\n",
       " 'headers.dist': 1,\n",
       " 'cffi': 1,\n",
       " 'extras': 1,\n",
       " 'pyasn1': 1,\n",
       " 'requests': 2,\n",
       " 'kerberos': 1,\n",
       " 'gutentag': 2,\n",
       " 'pyopenssl': 1,\n",
       " 'characteristic': 1,\n",
       " 'selenium': 1,\n",
       " 'txws': 1,\n",
       " 'kitchen': 1,\n",
       " 'pygments': 2,\n",
       " 'botocore': 1,\n",
       " 'twisted': 1,\n",
       " 'beaker-common': 1,\n",
       " 'jenkinsapi': 1,\n",
       " 'jenkins-job-builder': 1,\n",
       " 'generatejob2': 1,\n",
       " 'babel': 2,\n",
       " 'stevedore-examples': 1,\n",
       " 'pytz': 3,\n",
       " 'pyjwt': 1,\n",
       " 'daiquiri': 1,\n",
       " 'iniparse': 1,\n",
       " 'kobo': 1,\n",
       " 'arrow': 1,\n",
       " 'python-dateutil': 1,\n",
       " 'setuptools': 6,\n",
       " 'shipshift': 1,\n",
       " 'docopt': 1,\n",
       " 'pip': 4,\n",
       " 'pyzmq': 2,\n",
       " 'certifi': 1,\n",
       " 'errata-tool': 1,\n",
       " 'service-identity': 1,\n",
       " 'rfc5424-logging-handler': 1,\n",
       " 'cryptography': 1,\n",
       " 'zope.interface': 1,\n",
       " 'daemon': 1,\n",
       " 'jinja2': 3,\n",
       " 'virtualenv': 2,\n",
       " 'beaker-client': 1,\n",
       " 'mock': 1,\n",
       " 'gear': 1,\n",
       " 'gyp': 1,\n",
       " 'pbr': 2,\n",
       " 'stevedore-examples2': 1,\n",
       " 'smartcols': 1,\n",
       " 'stomp.py': 1,\n",
       " 'simple.dist': 1,\n",
       " 'requests-kerberos': 2,\n",
       " 'xmltodict': 1,\n",
       " 'urllib3': 3,\n",
       " 'nose': 2,\n",
       " 'coverage': 1,\n",
       " 'six': 3,\n",
       " 'stevedore': 1,\n",
       " 'python-jenkins': 1,\n",
       " 'asn1crypto': 1,\n",
       " 'wheel': 2,\n",
       " 'nose-cov': 1,\n",
       " 'jsonpath-rw': 1,\n",
       " 'moksha.hub': 2,\n",
       " 'futures': 1,\n",
       " 'prometheus-client': 1,\n",
       " 'cov-core': 1,\n",
       " 'jmespath': 1,\n",
       " 'sphinx': 1,\n",
       " 'chardet': 2,\n",
       " 'lockfile': 1,\n",
       " 's3transfer': 1,\n",
       " 'subscription-manager': 1,\n",
       " 'complex-dist': 1,\n",
       " 'fasteners': 1,\n",
       " 'pillow': 1,\n",
       " 'pyxattr': 1,\n",
       " 'python-qpid-proton': 1}"
      ]
     },
     "execution_count": 88,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_result.result"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can get results as Pandas dataframe:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Package Name</th>\n",
       "      <th># Versions</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>tzlocal</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>pycparser</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>markupsafe</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>redis</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>fedmsg</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>pyasn1-modules</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>stomper</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>moksha.common</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>lxml</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>docutils</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>m2crypto</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>werkzeug</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>click</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>sqlalchemy</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>pyyaml</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>prettytable</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>boto3</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>pyliblzma</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>pygithub</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>idna</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>decorator</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>python-daemon</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>headers.dist</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>cffi</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>extras</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>pyasn1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>requests</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>kerberos</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>gutentag</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>pyopenssl</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>smartcols</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>stomp.py</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>simple.dist</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>requests-kerberos</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>xmltodict</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>urllib3</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>nose</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>coverage</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>six</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>stevedore</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80</th>\n",
       "      <td>python-jenkins</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>asn1crypto</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>wheel</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83</th>\n",
       "      <td>nose-cov</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>jsonpath-rw</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>moksha.hub</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>futures</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>prometheus-client</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>cov-core</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>jmespath</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>sphinx</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>91</th>\n",
       "      <td>chardet</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>lockfile</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>93</th>\n",
       "      <td>s3transfer</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>subscription-manager</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>complex-dist</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>fasteners</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>pillow</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>pyxattr</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>python-qpid-proton</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>100 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "            Package Name  # Versions\n",
       "0                tzlocal           1\n",
       "1              pycparser           1\n",
       "2             markupsafe           2\n",
       "3                  redis           1\n",
       "4                 fedmsg           1\n",
       "5         pyasn1-modules           1\n",
       "6                stomper           1\n",
       "7          moksha.common           1\n",
       "8                   lxml           1\n",
       "9               docutils           1\n",
       "10              m2crypto           1\n",
       "11              werkzeug           1\n",
       "12                 click           1\n",
       "13            sqlalchemy           1\n",
       "14                pyyaml           2\n",
       "15           prettytable           1\n",
       "16                 boto3           1\n",
       "17             pyliblzma           1\n",
       "18              pygithub           1\n",
       "19                  idna           1\n",
       "20             decorator           1\n",
       "21         python-daemon           2\n",
       "22          headers.dist           1\n",
       "23                  cffi           1\n",
       "24                extras           1\n",
       "25                pyasn1           1\n",
       "26              requests           2\n",
       "27              kerberos           1\n",
       "28              gutentag           2\n",
       "29             pyopenssl           1\n",
       "..                   ...         ...\n",
       "70             smartcols           1\n",
       "71              stomp.py           1\n",
       "72           simple.dist           1\n",
       "73     requests-kerberos           2\n",
       "74             xmltodict           1\n",
       "75               urllib3           3\n",
       "76                  nose           2\n",
       "77              coverage           1\n",
       "78                   six           3\n",
       "79             stevedore           1\n",
       "80        python-jenkins           1\n",
       "81            asn1crypto           1\n",
       "82                 wheel           2\n",
       "83              nose-cov           1\n",
       "84           jsonpath-rw           1\n",
       "85            moksha.hub           2\n",
       "86               futures           1\n",
       "87     prometheus-client           1\n",
       "88              cov-core           1\n",
       "89              jmespath           1\n",
       "90                sphinx           1\n",
       "91               chardet           2\n",
       "92              lockfile           1\n",
       "93            s3transfer           1\n",
       "94  subscription-manager           1\n",
       "95          complex-dist           1\n",
       "96             fasteners           1\n",
       "97                pillow           1\n",
       "98               pyxattr           1\n",
       "99    python-qpid-proton           1\n",
       "\n",
       "[100 rows x 2 columns]"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "r=query_result.result\n",
    "df = pd.DataFrame(list(r.items()), columns=['Package Name', '# Versions'])\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "If we get result as a dictionary of values, we can easily plot some graphs:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = adapter.g.V().has('__label__', 'python_package_version').groupCount().by('package_name').next()\n",
    "query_result = gqr(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<script>requirejs.config({paths: { 'plotly': ['https://cdn.plot.ly/plotly-latest.min']},});if(!window.Plotly) {{require(['plotly'],function(plotly) {window.Plotly=plotly;});}}</script>"
      ],
      "text/vnd.plotly.v1+html": [
       "<script>requirejs.config({paths: { 'plotly': ['https://cdn.plot.ly/plotly-latest.min']},});if(!window.Plotly) {{require(['plotly'],function(plotly) {window.Plotly=plotly;});}}</script>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.plotly.v1+json": {
       "data": [
        {
         "type": "bar",
         "uid": "b90ea45a-c7af-11e8-bd95-5c514fad9463",
         "x": [
          "tzlocal",
          "pycparser",
          "markupsafe",
          "redis",
          "fedmsg",
          "pyasn1-modules",
          "stomper",
          "moksha.common",
          "lxml",
          "docutils",
          "m2crypto",
          "werkzeug",
          "click",
          "sqlalchemy",
          "pyyaml",
          "prettytable",
          "boto3",
          "pyliblzma",
          "pygithub",
          "idna",
          "decorator",
          "python-daemon",
          "headers.dist",
          "cffi",
          "extras",
          "pyasn1",
          "requests",
          "kerberos",
          "gutentag",
          "pyopenssl",
          "characteristic",
          "selenium",
          "txws",
          "kitchen",
          "pygments",
          "botocore",
          "twisted",
          "beaker-common",
          "jenkinsapi",
          "jenkins-job-builder",
          "generatejob2",
          "babel",
          "stevedore-examples",
          "pytz",
          "pyjwt",
          "daiquiri",
          "iniparse",
          "kobo",
          "arrow",
          "python-dateutil",
          "setuptools",
          "shipshift",
          "docopt",
          "pip",
          "pyzmq",
          "certifi",
          "errata-tool",
          "service-identity",
          "rfc5424-logging-handler",
          "cryptography",
          "zope.interface",
          "daemon",
          "jinja2",
          "virtualenv",
          "beaker-client",
          "mock",
          "gear",
          "gyp",
          "pbr",
          "stevedore-examples2",
          "smartcols",
          "stomp.py",
          "simple.dist",
          "requests-kerberos",
          "xmltodict",
          "urllib3",
          "nose",
          "coverage",
          "six",
          "stevedore",
          "python-jenkins",
          "asn1crypto",
          "wheel",
          "nose-cov",
          "jsonpath-rw",
          "moksha.hub",
          "futures",
          "prometheus-client",
          "cov-core",
          "jmespath",
          "sphinx",
          "chardet",
          "lockfile",
          "s3transfer",
          "subscription-manager",
          "complex-dist",
          "fasteners",
          "pillow",
          "pyxattr",
          "python-qpid-proton"
         ],
         "y": [
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          2,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          1,
          2,
          1,
          3,
          1,
          1,
          1,
          1,
          1,
          1,
          6,
          1,
          1,
          4,
          2,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          3,
          2,
          1,
          1,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          2,
          1,
          3,
          2,
          1,
          3,
          1,
          1,
          1,
          2,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          1
         ]
        }
       ],
       "layout": {}
      },
      "text/html": [
       "<div id=\"6078920d-0611-4542-8ffa-252eb03771eb\" style=\"height: 525px; width: 100%;\" class=\"plotly-graph-div\"></div><script type=\"text/javascript\">require([\"plotly\"], function(Plotly) { window.PLOTLYENV=window.PLOTLYENV || {};window.PLOTLYENV.BASE_URL=\"https://plot.ly\";Plotly.newPlot(\"6078920d-0611-4542-8ffa-252eb03771eb\", [{\"x\": [\"tzlocal\", \"pycparser\", \"markupsafe\", \"redis\", \"fedmsg\", \"pyasn1-modules\", \"stomper\", \"moksha.common\", \"lxml\", \"docutils\", \"m2crypto\", \"werkzeug\", \"click\", \"sqlalchemy\", \"pyyaml\", \"prettytable\", \"boto3\", \"pyliblzma\", \"pygithub\", \"idna\", \"decorator\", \"python-daemon\", \"headers.dist\", \"cffi\", \"extras\", \"pyasn1\", \"requests\", \"kerberos\", \"gutentag\", \"pyopenssl\", \"characteristic\", \"selenium\", \"txws\", \"kitchen\", \"pygments\", \"botocore\", \"twisted\", \"beaker-common\", \"jenkinsapi\", \"jenkins-job-builder\", \"generatejob2\", \"babel\", \"stevedore-examples\", \"pytz\", \"pyjwt\", \"daiquiri\", \"iniparse\", \"kobo\", \"arrow\", \"python-dateutil\", \"setuptools\", \"shipshift\", \"docopt\", \"pip\", \"pyzmq\", \"certifi\", \"errata-tool\", \"service-identity\", \"rfc5424-logging-handler\", \"cryptography\", \"zope.interface\", \"daemon\", \"jinja2\", \"virtualenv\", \"beaker-client\", \"mock\", \"gear\", \"gyp\", \"pbr\", \"stevedore-examples2\", \"smartcols\", \"stomp.py\", \"simple.dist\", \"requests-kerberos\", \"xmltodict\", \"urllib3\", \"nose\", \"coverage\", \"six\", \"stevedore\", \"python-jenkins\", \"asn1crypto\", \"wheel\", \"nose-cov\", \"jsonpath-rw\", \"moksha.hub\", \"futures\", \"prometheus-client\", \"cov-core\", \"jmespath\", \"sphinx\", \"chardet\", \"lockfile\", \"s3transfer\", \"subscription-manager\", \"complex-dist\", \"fasteners\", \"pillow\", \"pyxattr\", \"python-qpid-proton\"], \"y\": [1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 3, 1, 1, 1, 1, 1, 1, 6, 1, 1, 4, 2, 1, 1, 1, 1, 1, 1, 1, 3, 2, 1, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 3, 2, 1, 3, 1, 1, 1, 2, 1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1], \"type\": \"bar\", \"uid\": \"b911e4bc-c7af-11e8-bd95-5c514fad9463\"}], {}, {\"showLink\": true, \"linkText\": \"Export to plot.ly\"})});</script>"
      ],
      "text/vnd.plotly.v1+html": [
       "<div id=\"6078920d-0611-4542-8ffa-252eb03771eb\" style=\"height: 525px; width: 100%;\" class=\"plotly-graph-div\"></div><script type=\"text/javascript\">require([\"plotly\"], function(Plotly) { window.PLOTLYENV=window.PLOTLYENV || {};window.PLOTLYENV.BASE_URL=\"https://plot.ly\";Plotly.newPlot(\"6078920d-0611-4542-8ffa-252eb03771eb\", [{\"x\": [\"tzlocal\", \"pycparser\", \"markupsafe\", \"redis\", \"fedmsg\", \"pyasn1-modules\", \"stomper\", \"moksha.common\", \"lxml\", \"docutils\", \"m2crypto\", \"werkzeug\", \"click\", \"sqlalchemy\", \"pyyaml\", \"prettytable\", \"boto3\", \"pyliblzma\", \"pygithub\", \"idna\", \"decorator\", \"python-daemon\", \"headers.dist\", \"cffi\", \"extras\", \"pyasn1\", \"requests\", \"kerberos\", \"gutentag\", \"pyopenssl\", \"characteristic\", \"selenium\", \"txws\", \"kitchen\", \"pygments\", \"botocore\", \"twisted\", \"beaker-common\", \"jenkinsapi\", \"jenkins-job-builder\", \"generatejob2\", \"babel\", \"stevedore-examples\", \"pytz\", \"pyjwt\", \"daiquiri\", \"iniparse\", \"kobo\", \"arrow\", \"python-dateutil\", \"setuptools\", \"shipshift\", \"docopt\", \"pip\", \"pyzmq\", \"certifi\", \"errata-tool\", \"service-identity\", \"rfc5424-logging-handler\", \"cryptography\", \"zope.interface\", \"daemon\", \"jinja2\", \"virtualenv\", \"beaker-client\", \"mock\", \"gear\", \"gyp\", \"pbr\", \"stevedore-examples2\", \"smartcols\", \"stomp.py\", \"simple.dist\", \"requests-kerberos\", \"xmltodict\", \"urllib3\", \"nose\", \"coverage\", \"six\", \"stevedore\", \"python-jenkins\", \"asn1crypto\", \"wheel\", \"nose-cov\", \"jsonpath-rw\", \"moksha.hub\", \"futures\", \"prometheus-client\", \"cov-core\", \"jmespath\", \"sphinx\", \"chardet\", \"lockfile\", \"s3transfer\", \"subscription-manager\", \"complex-dist\", \"fasteners\", \"pillow\", \"pyxattr\", \"python-qpid-proton\"], \"y\": [1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 3, 1, 1, 1, 1, 1, 1, 6, 1, 1, 4, 2, 1, 1, 1, 1, 1, 1, 1, 3, 2, 1, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 3, 2, 1, 3, 1, 1, 1, 2, 1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1], \"type\": \"bar\", \"uid\": \"b911e4bc-c7af-11e8-bd95-5c514fad9463\"}], {}, {\"showLink\": true, \"linkText\": \"Export to plot.ly\"})});</script>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query_result.plot_bar()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<script>requirejs.config({paths: { 'plotly': ['https://cdn.plot.ly/plotly-latest.min']},});if(!window.Plotly) {{require(['plotly'],function(plotly) {window.Plotly=plotly;});}}</script>"
      ],
      "text/vnd.plotly.v1+html": [
       "<script>requirejs.config({paths: { 'plotly': ['https://cdn.plot.ly/plotly-latest.min']},});if(!window.Plotly) {{require(['plotly'],function(plotly) {window.Plotly=plotly;});}}</script>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.plotly.v1+json": {
       "data": [
        {
         "labels": [
          "tzlocal",
          "pycparser",
          "markupsafe",
          "redis",
          "fedmsg",
          "pyasn1-modules",
          "stomper",
          "moksha.common",
          "lxml",
          "docutils",
          "m2crypto",
          "werkzeug",
          "click",
          "sqlalchemy",
          "pyyaml",
          "prettytable",
          "boto3",
          "pyliblzma",
          "pygithub",
          "idna",
          "decorator",
          "python-daemon",
          "headers.dist",
          "cffi",
          "extras",
          "pyasn1",
          "requests",
          "kerberos",
          "gutentag",
          "pyopenssl",
          "characteristic",
          "selenium",
          "txws",
          "kitchen",
          "pygments",
          "botocore",
          "twisted",
          "beaker-common",
          "jenkinsapi",
          "jenkins-job-builder",
          "generatejob2",
          "babel",
          "stevedore-examples",
          "pytz",
          "pyjwt",
          "daiquiri",
          "iniparse",
          "kobo",
          "arrow",
          "python-dateutil",
          "setuptools",
          "shipshift",
          "docopt",
          "pip",
          "pyzmq",
          "certifi",
          "errata-tool",
          "service-identity",
          "rfc5424-logging-handler",
          "cryptography",
          "zope.interface",
          "daemon",
          "jinja2",
          "virtualenv",
          "beaker-client",
          "mock",
          "gear",
          "gyp",
          "pbr",
          "stevedore-examples2",
          "smartcols",
          "stomp.py",
          "simple.dist",
          "requests-kerberos",
          "xmltodict",
          "urllib3",
          "nose",
          "coverage",
          "six",
          "stevedore",
          "python-jenkins",
          "asn1crypto",
          "wheel",
          "nose-cov",
          "jsonpath-rw",
          "moksha.hub",
          "futures",
          "prometheus-client",
          "cov-core",
          "jmespath",
          "sphinx",
          "chardet",
          "lockfile",
          "s3transfer",
          "subscription-manager",
          "complex-dist",
          "fasteners",
          "pillow",
          "pyxattr",
          "python-qpid-proton"
         ],
         "type": "pie",
         "uid": "b9a6070a-c7af-11e8-bd95-5c514fad9463",
         "values": [
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          2,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          1,
          2,
          1,
          3,
          1,
          1,
          1,
          1,
          1,
          1,
          6,
          1,
          1,
          4,
          2,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          3,
          2,
          1,
          1,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          2,
          1,
          3,
          2,
          1,
          3,
          1,
          1,
          1,
          2,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          2,
          1,
          1,
          1,
          1,
          1,
          1,
          1,
          1
         ]
        }
       ],
       "layout": {}
      },
      "text/html": [
       "<div id=\"401ca69e-beed-468c-b65d-44406f9fa440\" style=\"height: 525px; width: 100%;\" class=\"plotly-graph-div\"></div><script type=\"text/javascript\">require([\"plotly\"], function(Plotly) { window.PLOTLYENV=window.PLOTLYENV || {};window.PLOTLYENV.BASE_URL=\"https://plot.ly\";Plotly.newPlot(\"401ca69e-beed-468c-b65d-44406f9fa440\", [{\"labels\": [\"tzlocal\", \"pycparser\", \"markupsafe\", \"redis\", \"fedmsg\", \"pyasn1-modules\", \"stomper\", \"moksha.common\", \"lxml\", \"docutils\", \"m2crypto\", \"werkzeug\", \"click\", \"sqlalchemy\", \"pyyaml\", \"prettytable\", \"boto3\", \"pyliblzma\", \"pygithub\", \"idna\", \"decorator\", \"python-daemon\", \"headers.dist\", \"cffi\", \"extras\", \"pyasn1\", \"requests\", \"kerberos\", \"gutentag\", \"pyopenssl\", \"characteristic\", \"selenium\", \"txws\", \"kitchen\", \"pygments\", \"botocore\", \"twisted\", \"beaker-common\", \"jenkinsapi\", \"jenkins-job-builder\", \"generatejob2\", \"babel\", \"stevedore-examples\", \"pytz\", \"pyjwt\", \"daiquiri\", \"iniparse\", \"kobo\", \"arrow\", \"python-dateutil\", \"setuptools\", \"shipshift\", \"docopt\", \"pip\", \"pyzmq\", \"certifi\", \"errata-tool\", \"service-identity\", \"rfc5424-logging-handler\", \"cryptography\", \"zope.interface\", \"daemon\", \"jinja2\", \"virtualenv\", \"beaker-client\", \"mock\", \"gear\", \"gyp\", \"pbr\", \"stevedore-examples2\", \"smartcols\", \"stomp.py\", \"simple.dist\", \"requests-kerberos\", \"xmltodict\", \"urllib3\", \"nose\", \"coverage\", \"six\", \"stevedore\", \"python-jenkins\", \"asn1crypto\", \"wheel\", \"nose-cov\", \"jsonpath-rw\", \"moksha.hub\", \"futures\", \"prometheus-client\", \"cov-core\", \"jmespath\", \"sphinx\", \"chardet\", \"lockfile\", \"s3transfer\", \"subscription-manager\", \"complex-dist\", \"fasteners\", \"pillow\", \"pyxattr\", \"python-qpid-proton\"], \"values\": [1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 3, 1, 1, 1, 1, 1, 1, 6, 1, 1, 4, 2, 1, 1, 1, 1, 1, 1, 1, 3, 2, 1, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 3, 2, 1, 3, 1, 1, 1, 2, 1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1], \"type\": \"pie\", \"uid\": \"b9a9a450-c7af-11e8-bd95-5c514fad9463\"}], {}, {\"showLink\": true, \"linkText\": \"Export to plot.ly\"})});</script>"
      ],
      "text/vnd.plotly.v1+html": [
       "<div id=\"401ca69e-beed-468c-b65d-44406f9fa440\" style=\"height: 525px; width: 100%;\" class=\"plotly-graph-div\"></div><script type=\"text/javascript\">require([\"plotly\"], function(Plotly) { window.PLOTLYENV=window.PLOTLYENV || {};window.PLOTLYENV.BASE_URL=\"https://plot.ly\";Plotly.newPlot(\"401ca69e-beed-468c-b65d-44406f9fa440\", [{\"labels\": [\"tzlocal\", \"pycparser\", \"markupsafe\", \"redis\", \"fedmsg\", \"pyasn1-modules\", \"stomper\", \"moksha.common\", \"lxml\", \"docutils\", \"m2crypto\", \"werkzeug\", \"click\", \"sqlalchemy\", \"pyyaml\", \"prettytable\", \"boto3\", \"pyliblzma\", \"pygithub\", \"idna\", \"decorator\", \"python-daemon\", \"headers.dist\", \"cffi\", \"extras\", \"pyasn1\", \"requests\", \"kerberos\", \"gutentag\", \"pyopenssl\", \"characteristic\", \"selenium\", \"txws\", \"kitchen\", \"pygments\", \"botocore\", \"twisted\", \"beaker-common\", \"jenkinsapi\", \"jenkins-job-builder\", \"generatejob2\", \"babel\", \"stevedore-examples\", \"pytz\", \"pyjwt\", \"daiquiri\", \"iniparse\", \"kobo\", \"arrow\", \"python-dateutil\", \"setuptools\", \"shipshift\", \"docopt\", \"pip\", \"pyzmq\", \"certifi\", \"errata-tool\", \"service-identity\", \"rfc5424-logging-handler\", \"cryptography\", \"zope.interface\", \"daemon\", \"jinja2\", \"virtualenv\", \"beaker-client\", \"mock\", \"gear\", \"gyp\", \"pbr\", \"stevedore-examples2\", \"smartcols\", \"stomp.py\", \"simple.dist\", \"requests-kerberos\", \"xmltodict\", \"urllib3\", \"nose\", \"coverage\", \"six\", \"stevedore\", \"python-jenkins\", \"asn1crypto\", \"wheel\", \"nose-cov\", \"jsonpath-rw\", \"moksha.hub\", \"futures\", \"prometheus-client\", \"cov-core\", \"jmespath\", \"sphinx\", \"chardet\", \"lockfile\", \"s3transfer\", \"subscription-manager\", \"complex-dist\", \"fasteners\", \"pillow\", \"pyxattr\", \"python-qpid-proton\"], \"values\": [1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 3, 1, 1, 1, 1, 1, 1, 6, 1, 1, 4, 2, 1, 1, 1, 1, 1, 1, 1, 3, 2, 1, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 3, 2, 1, 3, 1, 1, 1, 2, 1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1], \"type\": \"pie\", \"uid\": \"b9a9a450-c7af-11e8-bd95-5c514fad9463\"}], {}, {\"showLink\": true, \"linkText\": \"Export to plot.ly\"})});</script>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Or a pie chart\n",
    "\n",
    "query_result.plot_pie()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "To get more options on how to visualize and interact with data retrieved from graph database, use the `help` function to access up-to-date `GraphQueryResult` documentation:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Help on class GraphQueryResult in module thoth.lab.graph:\n",
      "\n",
      "class GraphQueryResult(builtins.object)\n",
      " |  Methods defined here:\n",
      " |  \n",
      " |  __init__(self, result)\n",
      " |      Initialization.\n",
      " |      \n",
      " |      :param result: the result to be used as a query result, can be directly coroutine that is fired.\n",
      " |  \n",
      " |  plot_bar(self)\n",
      " |      Plot histogram of results obtained.\n",
      " |  \n",
      " |  plot_pie(self)\n",
      " |      Plot a pie of results into Jupyter notebook.\n",
      " |  \n",
      " |  serialize(self)\n",
      " |      Serialize the output of graph query.\n",
      " |  \n",
      " |  to_dataframe(self)\n",
      " |      Construct a panda's dataframe on results.\n",
      " |  \n",
      " |  ----------------------------------------------------------------------\n",
      " |  Data descriptors defined here:\n",
      " |  \n",
      " |  __dict__\n",
      " |      dictionary for instance variables (if defined)\n",
      " |  \n",
      " |  __weakref__\n",
      " |      list of weak references to the object (if defined)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "help(gqr)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[]\n",
      "CPU times: user 4.76 ms, sys: 0 ns, total: 4.76 ms\n",
      "Wall time: 776 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "from gremlin_python.process.graph_traversal import has\n",
    "from gremlin_python.process.traversal import Operator\n",
    "from gremlin_python.process.traversal import Pop\n",
    "from gremlin_python.process.traversal import not_\n",
    "from gremlin_python.process.graph_traversal import identity\n",
    "from gremlin_python.process.graph_traversal import outE\n",
    "from gremlin_python.process.graph_traversal import out\n",
    "from gremlin_python.process.graph_traversal import inE\n",
    "from gremlin_python.process.graph_traversal import select\n",
    "from gremlin_python.process.graph_traversal import values\n",
    "from gremlin_python.process.graph_traversal import fold\n",
    "from gremlin_python.process.graph_traversal import constant\n",
    "from gremlin_python.process.graph_traversal import project\n",
    "\n",
    "\n",
    "query = adapter.g.V().has('package_name', 'jinja2').has('package_version', '2.7.2').repeat(outE().simplePath().has('__label__', 'depends_on').inV().has('__label__', 'python_package_version')).emit().path().by(project('package', 'version').by('package_name').by('package_version')).by(project('depends_on').by('version_range')).toList()\n",
    "\n",
    "query_result = gqr(query)\n",
    "\n",
    "print(query_result.result)\n",
    "\n",
    "\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For more info on how to construct queries to the graph database, see [Practical Gremlin: An Apache TinkerPop Tutorial](http://kelvinlawrence.net/book/Gremlin-Graph-Guide.html). Also see [pandas.DataFrame](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html#pandas.DataFrame) documentation on how to use dataframes and [plotly documentation](https://plot.ly/api/) for creating interactive figures. To visualize data available in the graph, use the [graph explorer](https://url.corp.redhat.com/thoth-sbu-graphexp)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'package_name': ['markupsafe'], 'id': 987368, 'label': 'package', 'ecosystem': ['pypi'], '__label__': ['package'], '__type__': ['vertex']}, {'id': 42471472, 'package_version': ['0.23'], 'ecosystem': ['pypi'], '__label__': ['python_package_version'], '__type__': ['vertex'], 'package_name': ['markupsafe'], 'label': 'python_package_version'}, {'id': 82915384, 'package_version': ['0.11'], 'ecosystem': ['pypi'], '__label__': ['python_package_version'], '__type__': ['vertex'], 'package_name': ['markupsafe'], 'label': 'python_package_version'}]\n"
     ]
    }
   ],
   "source": [
    "\n",
    "#query = adapter.g.V().has('package_name', 'markupsafe').toList()\n",
    "\n",
    "query = adapter.g.V().has('package_name', 'markupsafe').valueMap(True).toList()\n",
    "\n",
    "\n",
    "\n",
    "query_result = gqr(query)\n",
    "print(query_result.result)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
